[{"name": "The Umbrella Academy             ", "storyline": "    On the same day in October 1989, forty-three infants are inexplicably born to random, unconnected women who showed no signs of pregnancy the day before. Seven are adopted by Sir Reginald Hargreeves, a billionaire industrialist, who creates The Umbrella Academy and prepares his \"children\" to save the world. But not everything went according to plan. In their teenage years, the family fractured and the team disbanded. Now, the six surviving thirty-something members reunite upon the news of Hargreeves' passing. Luther, Diego, Allison, Klaus, Vanya and Number Five work together to solve a mystery surrounding their father's death. But the estranged family once again begins to come apart due to their divergent personalities and abilities, not to mention the imminent threat of a global apocalypse.", "genre": "action", "link": "https://www.imdb.com/title/tt1312171/?ref_=adv_li_i/"}, {"name": "Game of Thrones             ", "storyline": "    In the mythical continent of Westeros, several powerful families fight for control of the Seven Kingdoms. As conflict erupts in the kingdoms of men, an ancient enemy rises once again to threaten them all. Meanwhile, the last heirs of a recently usurped dynasty plot to take back their homeland from across the Narrow Sea.", "genre": "action", "link": "https://www.imdb.com/title/tt0944947/?ref_=adv_li_i/"}, {"name": "Alita: Battle Angel (2019) ", "storyline": "    Alita is a creation from an age of despair. Found by the mysterious Dr. Ido while trolling for cyborg parts, Alita becomes a lethal, dangerous being. She cannot remember who she is, or where she came from. But to Dr. Ido, the truth is all too clear. She is the one being who can break the cycle of death and destruction left behind from Tiphares. But to accomplish her true purpose, she must fight and kill. And that is where Alita's true significance comes to bear. She is an angel from heaven. She is an angel of death.", "genre": "action", "link": "https://www.imdb.com/title/tt0437086/?ref_=adv_li_i/"}, {"name": "Spider-Man: Into the Spider-Verse (2018) ", "storyline": "    Miles Morales is a New York teen struggling with school, friends and, on top of that, being the new Spider-Man. When he comes across Peter Parker, the erstwhile saviour of New York, in the multiverse, Miles must train to become the new protector of his city.", "genre": "action", "link": "https://www.imdb.com/title/tt4633694/?ref_=adv_li_i/"}, {"name": "Captain Marvel (2019) ", "storyline": "    Carol Danvers becomes one of the universe's most powerful heroes when Earth is caught in the middle of a galactic war between two alien races.", "genre": "action", "link": "https://www.imdb.com/title/tt4154664/?ref_=adv_li_i/"}, {"name": "Dark Phoenix (2019) ", "storyline": "    Jean Grey begins to develop incredible powers that corrupt and turn her into a Dark Phoenix. Now the X-Men will have to decide if the life of a team member is worth more than all the people living in the world.", "genre": "action", "link": "https://www.imdb.com/title/tt6565702/?ref_=adv_li_i/"}, {"name": "How to Train Your Dragon: The Hidden World (2019) ", "storyline": "    As Hiccup fulfills his dream of creating a peaceful dragon utopia, Toothless' discovery of an untamed, elusive mate draws the Night Fury away. When danger mounts at home and Hiccup's reign as village chief is tested, both dragon and rider must make impossible decisions to save their kind.", "genre": "action", "link": "https://www.imdb.com/title/tt2386490/?ref_=adv_li_i/"}, {"name": "Doom Patrol             ", "storyline": "    A re-imagining of one of DC's most beloved group of outcast Super Heroes: Robotman, Negative Man, Elasti-Girl and Crazy Jane, led by modern-day mad scientist Dr. Niles Caulder (The Chief). The Doom Patrol's members each suffered horrible accidents that gave them superhuman abilities - but also left them scarred and disfigured. Traumatized and downtrodden, the team found purpose through The Chief, who brought them together to investigate the weirdest phenomena in existence - and to protect Earth from what they find. Part support group, part Super Hero team, the Doom Patrol is a band of super-powered freaks who fight for a world that wants nothing to do with them. Picking up after the events of Titans, Doom Patrol will find these reluctant heroes in a place they never expected to be, called to action by none other than Cyborg, who comes to them with a mission hard to refuse, but with a warning that is hard to ignore: their lives will never, ever be the same.", "genre": "action", "link": "https://www.imdb.com/title/tt8416494/?ref_=adv_li_i/"}, {"name": "Black Panther (2018) ", "storyline": "    After the events of Captain America: Civil War, Prince T'Challa returns home to the reclusive, technologically advanced African nation of Wakanda to serve as his country's new king. However, T'Challa soon finds that he is challenged for the throne from factions within his own country. When two foes conspire to destroy Wakanda, the hero known as Black Panther must team up with C.I.A. agent Everett K. Ross and members of the Dora Milaje, Wakandan special forces, to prevent Wakanda from being dragged into a world war.", "genre": "action", "link": "https://www.imdb.com/title/tt1825683/?ref_=adv_li_i/"}, {"name": "Whiskey Cavalier             ", "storyline": "    An FBI agent and his new partner, a CIA operative, embark on missions to save the world, but have to put up with each other first.", "genre": "action", "link": "https://www.imdb.com/title/tt7599942/?ref_=adv_li_i/"}, {"name": "Avengers: Endgame (2019) ", "storyline": "    After the devastating events of Avengers: Infinity War (2018), the universe is in ruins. With the help of remaining allies, the Avengers assemble once more in order to undo Thanos' actions and restore order to the universe.", "genre": "action", "link": "https://www.imdb.com/title/tt4154796/?ref_=adv_li_i/"}, {"name": "Vikings             ", "storyline": "    The adventures of a Ragnar Lothbrok: the greatest hero of his age. The series tells the saga of Ragnar's band of Viking brothers and his family as he rises to become King of the Viking tribes. As well as being a fearless warrior, Ragnar embodies the Norse traditions of devotion to the gods: legend has it that he was a direct descendant of Odin, the god of war and warriors.", "genre": "action", "link": "https://www.imdb.com/title/tt2306299/?ref_=adv_li_i/"}, {"name": "Hellboy (2019) ", "storyline": "    Based on the graphic novels by Mike Mignola, Hellboy, caught between the worlds of the supernatural and human, battles an ancient sorceress bent on revenge.", "genre": "action", "link": "https://www.imdb.com/title/tt2274648/?ref_=adv_li_i/"}, {"name": "The Punisher             ", "storyline": "    After exacting revenge on those responsible for the death of his wife and children, Frank Castle uncovers a conspiracy that runs far deeper than New York's criminal underworld. Now known throughout the city as The Punisher, he must discover the truth about injustices that affect more than his family alone.", "genre": "action", "link": "https://www.imdb.com/title/tt5675620/?ref_=adv_li_i/"}, {"name": "Star Trek: Discovery             ", "storyline": "    Ten years before Kirk, Spock, and the Enterprise, the USS Discovery discovers new worlds and lifeforms as one Starfleet officer learns to understand all things alien.", "genre": "action", "link": "https://www.imdb.com/title/tt5171438/?ref_=adv_li_i/"}, {"name": "Gotham             ", "storyline": "    In crime ridden Gotham City, Thomas and Martha Wayne are murdered before young Bruce Wayne's eyes. Although Gotham City Police Department detectives, James Gordon, and his cynical partner, Harvey Bullock, seem to solace's the case quickly, things are not so simple. Inspired by Bruce's traumatized desire for justice, Gordon vows to find it amid Gotham's corruption. Thus begins Gordon's lonely quest that would set him against his own comrades and the underworld with their own deadly rivalries and mysteries. In the coming wars, innocence will be lost and compromises will be made as some criminals will fall as casualties while others will rise as super villains. All the while, young Bruce observes this war with a growing obsession that would one day drive him to seek his own justice against the evil of Gotham as The Batman.", "genre": "action", "link": "https://www.imdb.com/title/tt3749900/?ref_=adv_li_i/"}, {"name": "Polar (2019) ", "storyline": "    The world's top assassin, Duncan Vizla, is settling into retirement when his former employer marks him as a liability to the firm. Against his will, he finds himself back in the game going head to head with an army of younger killers.", "genre": "action", "link": "https://www.imdb.com/title/tt4139588/?ref_=adv_li_i/"}, {"name": "Cold Pursuit (2019) ", "storyline": "    Quiet family man and hard-working snowplow driver Nels is the lifeblood of a glitzy resort town in the Rocky Mountains because he is the one who keeps the winter roads clear. He and his wife live in a comfortable cabin away from the tourists. The town has just awarded him \"Citizen of the Year.\" But Nels has to leave his quiet mountain life when his son is murdered by a powerful drug lord. As a man who has nothing to lose he is stoked by a drive for vengeance. This unlikely hero uses his hunting skills and transforms from an ordinary man into a skilled killer as he sets out to dismantle the cartel. Nels' actions ignite a turf war between a manically unpredictable gangster known as Viking and a rival gang boss. Justice is served in one final spectacular confrontation that will leave (almost) no one unscathed.", "genre": "action", "link": "https://www.imdb.com/title/tt5719748/?ref_=adv_li_i/"}, {"name": "Aquaman (2018) ", "storyline": "    Arthur Curry, half human half from Atlantis, goes on a trip of a lifetime. Not only does this adventure compel him to come to terms with his real identity, but it also forces him to discover whether he is entirely worthy of fulfilling his own destiny: becoming a king.", "genre": "action", "link": "https://www.imdb.com/title/tt1477834/?ref_=adv_li_i/"}, {"name": "Overlord (2018) ", "storyline": "    On the eve of D-Day, the 5th of June, 1944, several American paratroopers are dropped behind enemy lines to carry out a mission crucial to the invasion's success: destroy a radio tower built in a little castle of an old French town that the Third Reich uses for communication between Berlin and Normandy beaches' bunkers. Due to the intense enemy fire, the planes are shot down and most soldiers die in the landing or are killed by the Nazis' night patrols after they land. However, a private named Ed Boyce survives to find Corporal Ford, a last-minute incorporation from Italy and a veteran expert in bombs and explosives, rogue sniper Tibbet, war photographer Chase, and finally private Dawson. After they watch the killing of their superior Sargeant Eldson by a Nazi night patrol, Ford becomes leader of the group and they try to get the town with the tower in order to complete the mission. In the forest close to the town they meet Chloe, a villager who assists the soldiers in her home with ...", "genre": "action", "link": "https://www.imdb.com/title/tt4530422/?ref_=adv_li_i/"}, {"name": "The Flash             ", "storyline": "    Barry Allen is a Central City police forensic scientist with a reasonably happy life, despite the childhood trauma of a mysterious red and yellow lightning killing his mother and framing his father. All that changes when a massive particle accelerator accident leads to Barry being struck by lightning in his lab. Coming out of coma nine months later, Barry and his new friends at S.T.A.R labs find that he now has the ability to move at superhuman speed. Furthermore, Barry learns that he is but one of many affected by that event, most of whom are using their powers for evil. Determined to make a difference, Barry dedicates his life to fighting such threats, as The Flash. While he gains allies he never expected, there are also secret forces determined to aid and manipulate him for their own agenda.", "genre": "action", "link": "https://www.imdb.com/title/tt3107288/?ref_=adv_li_i/"}, {"name": "NCIS: Naval Criminal Investigative Service             ", "storyline": "    Special Agent Leroy Jethro Gibbs is the leader of a team of special agents belonging to the NCIS (Naval Criminal Investigative Service) Major Case Response Team. Gibbs, a former Marine, is a tough investigator and a highly skilled interrogator who relies on his gut instinct as much as evidence. Gibbs' second in command is Senior Field Agent Tony DiNozzo, a womanizing, movie-quoting former Baltimore Homicide Detective, who despite being the class clown always gets the job done. The team also consists of probationary field agent Eleanor Bisbop, a former NSA agent, as well as Junior Field Agent Timothy McGee, a computer-savvy agent often mocked by DiNozzo. Assisting them are Abby Sciuto, the energetic-but-Goth lab tech who is like a daughter to Gibbs and is famously quoted as saying \"mike hunt won't stop bleeding!!\", and Dr. Donald Mallard, nicknamed Ducky, the eccentric medical examiner full of unusual stories. This team of elite agents, based in Washington, D.C., solve criminal cases ...", "genre": "action", "link": "https://www.imdb.com/title/tt0364845/?ref_=adv_li_i/"}, {"name": "Avengers: Infinity War (2018) ", "storyline": "    As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment, the fate of Earth and existence has never been more uncertain.", "genre": "action", "link": "https://www.imdb.com/title/tt4154756/?ref_=adv_li_i/"}, {"name": "Robin Hood (2018) ", "storyline": "    A war-hardened crusader Robin of Loxley (Taron Egerton) and his Moorish commander (Jamie Foxx) mount an audacious revolt against the corrupt English crown.", "genre": "action", "link": "https://www.imdb.com/title/tt4532826/?ref_=adv_li_i/"}, {"name": "Titans             ", "storyline": "    Titans follows young heroes from across the DC Universe as they come of age and find belonging in a gritty take on the classic Teen Titans franchise. Dick Grayson and Rachel Roth, a special young girl possessed by a strange darkness, get embroiled in a conspiracy that could bring Hell on Earth. Joining them along the way are the hot-headed Starfire and love-able Beast Boy. Together they become a surrogate family and team of heroes.", "genre": "action", "link": "https://www.imdb.com/title/tt1043813/?ref_=adv_li_i/"}, {"name": "Arrow             ", "storyline": "    Oliver Queen and his father are lost at sea when their luxury yacht sinks, apparently in a storm. His father dies, but Oliver survives for five years on an uncharted island and eventually returns home. But he wasn't alone on the island where he learned not only how to fight and survive but also of his father's corruption and unscrupulous business dealings. He returns to civilization a changed man, determined to put things right. He disguises himself with the hood of one of his mysterious island mentors, arms himself with a bow and sets about hunting down the men and women who have corrupted his city.", "genre": "action", "link": "https://www.imdb.com/title/tt2193021/?ref_=adv_li_i/"}, {"name": "Mortal Engines (2018) ", "storyline": "    A mysterious young woman, Hester Shaw, emerges as the only one who can stop a giant, predator city on wheels devouring everything in its path. Feral, and fiercely driven by the memory of her mother, Hester joins forces with Tom Natsworthy, an outcast from London, along with Anna Fang, a dangerous outlaw with a bounty on her head.", "genre": "action", "link": "https://www.imdb.com/title/tt1571234/?ref_=adv_li_i/"}, {"name": "Deadpool 2 (2018) ", "storyline": "    After losing Vanessa (Morena Baccarin), the love of his life, 4th-wall breaking mercenary Wade Wilson aka Deadpool (Ryan Reynolds) must assemble a team and protect a young, full-figured mutant Russell Collins aka Firefist (Julian Dennison) from Cable (Josh Brolin), a no-nonsense, dangerous cyborg from the future, and must also learn the most important lesson of all: to be part of a family again.", "genre": "action", "link": "https://www.imdb.com/title/tt5463162/?ref_=adv_li_i/"}, {"name": "The Lego Movie 2: The Second Part (2019) ", "storyline": "    It's been five years since everything was awesome and the citizens are facing a huge new threat: Lego Duplo invaders from outer space, wrecking everything faster than they can rebuild.", "genre": "action", "link": "https://www.imdb.com/title/tt3513498/?ref_=adv_li_i/"}, {"name": "Hawaii Five-0             ", "storyline": "    Steve McGarrett comes to Hawaii to avenge his father's death but when the governor offers his own task force, he accepts. He picks up team members on the way, Danny Williams, the head detective on his father's case, Chin Ho Kelly, a former HPD Detective who was fired for accused corruption and McGarrett's father's old patrol partner, Kono Kalakaua, a Cadet at the Police Academy who's 1 week from graduating, Lori Weston entry to Five-O temporarily, how Catharine Rollins a girl friend of Steve and Captain Lou Grover, a former Chicago PD Head of SWAT.", "genre": "action", "link": "https://www.imdb.com/title/tt1600194/?ref_=adv_li_i/"}, {"name": "Terminator: Dark Fate (2019) ", "storyline": "    Plot unknown.", "genre": "action", "link": "https://www.imdb.com/title/tt6450804/?ref_=adv_li_i/"}, {"name": "Ocean's Eight (2018) ", "storyline": "    Danny Ocean's estranged sister Debbie attempts to pull off the heist of the century at New York City's star-studded annual Met Gala. Her first stop is to assemble the perfect all-female crew: Lou, Rose, Daphne Kluger, Nine Ball, Tammy, Amita, and Constance.", "genre": "action", "link": "https://www.imdb.com/title/tt5164214/?ref_=adv_li_i/"}, {"name": "The Passage             ", "storyline": "    When a botched U.S. government experiment turns a group of death row inmates into highly infectious vampires, an orphan girl might be the only person able to stop the ensuing crisis.", "genre": "action", "link": "https://www.imdb.com/title/tt1074206/?ref_=adv_li_i/"}, {"name": "The Gifted             ", "storyline": "    In a world where mutated humans are treated with distrust and fear, an institute for mutants battles to achieve peaceful co-existence with humanity.", "genre": "action", "link": "https://www.imdb.com/title/tt4396630/?ref_=adv_li_i/"}, {"name": "Shadowhunters: The Mortal Instruments             ", "storyline": "    Clary Fray is a normal teenager living in Brooklyn with her mother. One day, she discovers that she is descended from a line of Shadowhunters; humans born with angelic blood that fight to protect our world from demons. After her mother is kidnapped, Clary must team up with three Shadowhunters: Jace, Alec and Isabelle and her best friend Simon on a quest to find her mother and recover her past.", "genre": "action", "link": "https://www.imdb.com/title/tt4145054/?ref_=adv_li_i/"}, {"name": "Incredibles 2 (2018) ", "storyline": "    While the Parr family has accepted its collective calling as superheroes, the fact remains that their special heroism is still illegal. After they are arrested after unsuccessfully trying to stop the Underminer, their future seems bleak. However, the wealthy Deavor siblings of Devtech offer new hope with a bold project to rehabilitate the public image and legal status of Supers, with Elastigirl being assigned on point to be the shining example. Now having agreed for now to stay at home to care of the kids, Mr. Incredible finds domestic life a daunting challenge, especially with baby Jack-Jack's newly emerged powers making him almost impossible to manage. However, Elastigirl soon has her own concerns dealing with the menace of a new supervillain, Screenslaver, who is wreaking havoc with his mind control abilities. Now, Elastigirl must solve the mystery of this enemy, who has malevolent designs on the world with the Parr family and friends key targets of this evil.", "genre": "action", "link": "https://www.imdb.com/title/tt3606756/?ref_=adv_li_i/"}, {"name": "Lethal Weapon             ", "storyline": "    A slightly unhinged cop is partnered with a veteran detective trying to maintain a low stress level in his life.", "genre": "action", "link": "https://www.imdb.com/title/tt5164196/?ref_=adv_li_i/"}, {"name": "Deadly Class             ", "storyline": "    Set in a dark, comic book world against the backdrop of late '80s counterculture, Deadly Class follows a homeless teen recruited into a storied elite private school where the world's top crime families send their next generations. Maintaining his moral code while surviving a ruthless curriculum, vicious social cliques and his own adolescent uncertainties soon proves to be vital.", "genre": "action", "link": "https://www.imdb.com/title/tt5924572/?ref_=adv_li_i/"}, {"name": "The Last Kingdom             ", "storyline": "    The year is 872, and many of the separate kingdoms of what we now know as England have fallen to the invading Danes, leaving the great kingdom of Wessex standing alone and defiant under the command of King Alfred. Against this turbulent backdrop lives our hero, Uhtred. Born the son of a Saxon nobleman, he is captured by the Danes and raised as one of their own. Forced to choose between the country of his birth and the people of his upbringing, his loyalties are ever tested. What is he? Saxon or Dane? On a quest to reclaim his birthright, Uhtred must tread a dangerous path between both sides if he is to play his part in the birth of a new nation and, ultimately, recapture his ancestral lands.", "genre": "action", "link": "https://www.imdb.com/title/tt4179452/?ref_=adv_li_i/"}, {"name": "Venom (2018) ", "storyline": "    After a faulty interview with the Life Foundation ruins his career, former reporter Eddie Brock's life is in pieces. Six months later, he comes across the Life Foundation again, and he comes into contact with an alien symbiote and becomes Venom, a parasitic antihero.", "genre": "action", "link": "https://www.imdb.com/title/tt1270797/?ref_=adv_li_i/"}, {"name": "Strike Back             ", "storyline": "    The flashy adventures, all over the world, of British secret service MI6's dashing special ops team Section 20's fearless hotshots. Scott and Stonebridge eagerly chase Latif, the Pakistani Al-Qaeda mastermind behind many terrorist crimes, but also other rogue threats to peace.", "genre": "action", "link": "https://www.imdb.com/title/tt1492179/?ref_=adv_li_i/"}, {"name": "Supergirl             ", "storyline": "    Years ago, Krypton was about to explode and Kal-El was sent to Earth to escape that fate. However, his older cousin, Kara, was also intended to accompany the infant as his protector. Unfortunately, Kara was accidentally diverted into the timeless Phantom Zone for years before finally arriving on Earth decades later and found by her cousin who had grown into Superman. Years later, Kara Danvers is a young professional adrift in a thankless job until a fateful crisis ignites a sense of purpose using Kryptonian powers she had long hidden. Inspired, Kara decides to emulate her cousin's superheroic ways, only to find her foster sister introducing her to the secret Department of Extra-Normal Operations, dedicated to fighting alien menaces including those Kara inadvertently led to Earth. Now with such help, the Maid of Might takes her place as Earth's newest champion with new friends and enemies challenging her world.", "genre": "action", "link": "https://www.imdb.com/title/tt4016454/?ref_=adv_li_i/"}, {"name": "Spider-Man: Far From Home (2019) ", "storyline": "    Our friendly neighborhood Super Hero decides to join his best friends Ned, MJ, and the rest of the gang on a European vacation. However, Peter's plan to leave super heroics behind for a few weeks are quickly scrapped when he begrudgingly agrees to help Nick Fury uncover the mystery of several elemental creature attacks, creating havoc across the continent.", "genre": "action", "link": "https://www.imdb.com/title/tt6320628/?ref_=adv_li_i/"}, {"name": "Escape Room (2019) ", "storyline": "    Six strangers are given mysterious black boxes with tickets to an immersive escape room for a chance to win tons of money. Being locked in several rooms with extreme conditions, they discover the secrets behind the escape room and must fight to survive and to find a way out.", "genre": "action", "link": "https://www.imdb.com/title/tt5886046/?ref_=adv_li_i/"}, {"name": "La casa de papel             ", "storyline": "    A group of very peculiar robbers assault the Factory of Moneda and Timbre to carry out the most perfect robbery in the history of Spain and take home 2.4 billion euros.", "genre": "action", "link": "https://www.imdb.com/title/tt6468322/?ref_=adv_li_i/"}, {"name": "Ready Player One (2018) ", "storyline": "    In the year 2045, the real world is a harsh place. The only time Wade Watts (Tye Sheridan) truly feels alive is when he escapes to the OASIS, an immersive virtual universe where most of humanity spends their days. In the OASIS, you can go anywhere, do anything, be anyone-the only limits are your own imagination. The OASIS was created by the brilliant and eccentric James Halliday (Mark Rylance), who left his immense fortune and total control of the Oasis to the winner of a three-part contest he designed to find a worthy heir. When Wade conquers the first challenge of the reality-bending treasure hunt, he and his friends-aka the High Five-are hurled into a fantastical universe of discovery and danger to save the OASIS.", "genre": "action", "link": "https://www.imdb.com/title/tt1677720/?ref_=adv_li_i/"}, {"name": "Van Helsing             ", "storyline": "    Van Helsing centers on Vanessa Helsing, the daughter of famous vampire hunter and Dracula nemesis Abraham Van Helsing. She is resurrected five years in the future to find out that vampires have taken over the world and that she possesses unique power over them. She is humanity's last hope to lead an offensive to take back what has been lost.", "genre": "action", "link": "https://www.imdb.com/title/tt5197820/?ref_=adv_li_i/"}, {"name": "Prison Break             ", "storyline": "    An innocent man is framed for the homicide of the Vice President's brother and scheduled to be executed at a super-max penitentiary, thus it's up to his younger brother to save him with his genius scheme: install himself in the same prison by holding up a bank and, as the final month ticks away, launch the escape plan step-by-step to break the both of them out, with his full-body tattoo acting as his guide; a tattoo which hides the layout of the prison facility and necessary clues vital to the escape.", "genre": "action", "link": "https://www.imdb.com/title/tt0455275/?ref_=adv_li_i/"}, {"name": "Solo: A Star Wars Story (2018) ", "storyline": "    With the emerging demand of hyperfuel and other resources, Han Solo finds himself in the middle of a heist alongside other criminals, where they meet the likes of Chewbacca and Lando Calrissian in an adventurous situation exposing the criminal underworld.", "genre": "action", "link": "https://www.imdb.com/title/tt3778644/?ref_=adv_li_i/"}, {"name": "Curfew             ", "storyline": "    In a society controlled by a strictly-enforced curfew, when day becomes night, people from all walks of life compete in a dangerous and illegal street race to escape the curfew and begin a new, free life outside the city. During this hurried pursuit for freedom, alliances and friendships are both made and lost, as people risk it all to win the race.", "genre": "action", "link": "https://www.imdb.com/title/tt7938588/?ref_=adv_li_i/"}]