[{"name": "Isn't It Romantic (2019) ", "storyline": "    A young woman disenchanted with love mysteriously finds herself trapped inside a romantic comedy.", "genre": "comedy", "link": "https://www.imdb.com/title/tt2452244/?ref_=adv_li_i/"}, {"name": "Sex Education             ", "storyline": "    A teenage boy with a sex therapist mother teams up with a high school classmate to set up an underground sex therapy clinic at school.", "genre": "comedy", "link": "https://www.imdb.com/title/tt7767422/?ref_=adv_li_i/"}, {"name": "Shameless             ", "storyline": "    Watch the Irish American family the Gallaghers deal with their alcoholic father Frank. Fiona, the eldest daughter, takes the role of the parent to her five brothers and sisters. Lip, Ian, Debbie, Carl, and Liam deal with life on the South Side of Chicago. Fiona balances her sex life and raising her siblings. Every episode is another crazy situation that one or more of the Gallagher six get into. Watch them grow and learn how to make their way in life with what little they have.", "genre": "comedy", "link": "https://www.imdb.com/title/tt1586680/?ref_=adv_li_i/"}, {"name": "Instant Family (2018) ", "storyline": "    Married couple Pete and Ellie Wagner, feeling a void in the marriage, visit a foster care center. Two social workers, Karen and Sharon, guide the hopeful parents on the steps to getting into becoming adoptive parents. The couples are brought to a fair where they have the chance to go up to kids that they are interested in adopting. Pete and Ellie walk by the teenagers, although Ellie shows hesitance over raising a teen, but one of the teens, Lizzie, informs Ellie that they all know no one wants to adopt the teens. Pete and Ellie talk to Karen and Sharon over potentially taking in Lizzie. The social workers inform the couple that Lizzie's mother is a drug addict who is currently in jail, and she set their home on fire because she left the crack pipe lit. It also turns out that Lizzie has two younger siblings, Juan and Lita. Although this seems like more of a challenge for Pete and Ellie, they agree to meet the siblings. Pete and Ellie have Thanksgiving dinner with Ellie's family, where...", "genre": "comedy", "link": "https://www.imdb.com/title/tt7401588/?ref_=adv_li_i/"}, {"name": "Russian Doll             ", "storyline": "    On Nadia's 36th birthday she is struck by a car and killed, only to finds herself alive and well, back at her own birthday party earlier that night. When she dies again and her timeline resets, Nadia begins to question her own sanity as she strives to unravel the mystery of why and how this is all happening.", "genre": "comedy", "link": "https://www.imdb.com/title/tt7520794/?ref_=adv_li_i/"}, {"name": "The Orville             ", "storyline": "    Set 400 years in the future, the show follows the adventures of the Orville, a not-so-top-of-the-line exploratory ship in Earth's interstellar Fleet. Facing cosmic challenges from without and within, this motley crew of space explorers will boldly go where no comedic drama has gone before.", "genre": "comedy", "link": "https://www.imdb.com/title/tt5691552/?ref_=adv_li_i/"}, {"name": "Brooklyn Nine-Nine             ", "storyline": "    Captain Ray Holt takes over Brooklyn's 99th precinct, which includes Detective Jake Peralta, a talented but carefree detective who's used to doing whatever he wants. The other employees of the 99th precinct include Detective Amy Santiago, Jake's over achieving and competitive partner; Detective Rosa Diaz, a tough and kept to herself coworker; Detective Charles Boyle, Jake's best friend who also has crush on Rosa; Detective Sergeant Terry Jeffords, who was recently taken off the field after the birth of his twin girls; and Gina Linetti, the precinct's sarcastic administrator.", "genre": "comedy", "link": "https://www.imdb.com/title/tt2467372/?ref_=adv_li_i/"}, {"name": "Once Upon a Time in Hollywood (2019) ", "storyline": "    A faded TV actor and his stunt double strive to achieve fame and success in the film industry during the final years of Hollywood's Golden Age in 1969 Los Angeles.", "genre": "comedy", "link": "https://www.imdb.com/title/tt7131622/?ref_=adv_li_i/"}, {"name": "The Big Bang Theory             ", "storyline": "    Leonard Hofstadter and Sheldon Cooper are both brilliant physicists working at Cal Tech in Pasadena, California. They are colleagues, best friends, and roommates, although in all capacities their relationship is always tested primarily by Sheldon's regimented, deeply eccentric, and non-conventional ways. They are also friends with their Cal Tech colleagues mechanical engineer Howard Wolowitz and astrophysicist Rajesh Koothrappali. The foursome spend their time working on their individual work projects, playing video games, watching science-fiction movies, or reading comic books. As they are self-professed nerds, all have little or no luck with women. When Penny, a pretty woman and an aspiring actress from Omaha, moves into the apartment across the hall from Leonard and Sheldon's, Leonard has another aspiration in life, namely to get Penny to be his girlfriend.", "genre": "comedy", "link": "https://www.imdb.com/title/tt0898266/?ref_=adv_li_i/"}, {"name": "Suits             ", "storyline": "    While running from a drug deal gone bad, Mike Ross, a brilliant young college dropout, slips into a job interview with one of New York City's best legal closers, Harvey Specter. Tired of cookie-cutter law school grads, Harvey takes a gamble by hiring Mike on the spot after he recognizes his raw talent and photographic memory. Mike and Harvey are a winning team. Even though Mike is a genius, he still has a lot to learn about law. And while Harvey may seem like an emotionless, cold-blooded shark, Mike's sympathy and concern for their cases and clients will help remind Harvey why he went into law in the first place. Mike's other allies in the office include the firm's best paralegal Rachel and Harvey's no-nonsense assistant Donna to help him serve justice. Proving to be an irrepressible duo and invaluable to the practice, Mike and Harvey must keep their secret from everyone including managing partner Jessica and Harvey's arch nemesis Louis, who seems intent on making Mike's life as ...", "genre": "comedy", "link": "https://www.imdb.com/title/tt1632701/?ref_=adv_li_i/"}, {"name": "The Office             ", "storyline": "    A mediocre paper company in the hands of Scranton, PA branch manager Michael Scott. This mockumentary follows the everyday lives of the manager and the employees he \"manages.\" The crew follows the employees around 24/7 and captures their quite humorous and bizarre encounters as they will do what it takes to keep the company thriving.", "genre": "comedy", "link": "https://www.imdb.com/title/tt0386676/?ref_=adv_li_i/"}, {"name": "Pokémon Detective Pikachu (2019) ", "storyline": "    The story begins when ace detective Harry Goodman goes mysteriously missing, prompting his 21-year-old son Tim to find out what happened. Aiding in the investigation is Harry's former Pokémon partner, Detective Pikachu: a hilariously wise-cracking, adorable super-sleuth who is a puzzlement even to himself. Finding that they are uniquely equipped to communicate with one another, Tim and Pikachu join forces on a thrilling adventure to unravel the tangled mystery. Chasing clues together through the neon-lit streets of Ryme City--a sprawling, modern metropolis where humans and Pokémon live side by side in a hyper-realistic live-action world--they encounter a diverse cast of Pokémon characters and uncover a shocking plot that could destroy this peaceful co-existence and threaten the whole Pokémon universe.", "genre": "comedy", "link": "https://www.imdb.com/title/tt5884052/?ref_=adv_li_i/"}, {"name": "Ralph Breaks the Internet (2018) ", "storyline": "    Taking place six years after saving the arcade from Turbo's vengeance, the Sugar Rush arcade cabinet has broken, forcing Ralph and Vanellope to travel to the Internet via the newly-installed Wi-Fi router in Litwak's Arcade to retrieve the piece capable of saving the game.", "genre": "comedy", "link": "https://www.imdb.com/title/tt5848272/?ref_=adv_li_i/"}, {"name": "Workin' Moms             ", "storyline": "    Workin' Moms follows the lives of four women as they juggle love, careers, and parenthood. They support, challenge, and try not to judge each other as life throws them curveballs. Whether it is an identity crisis, a huge job opportunity, postpartum depression, or an unplanned pregnancy - they face both the good and bad with grace and humour. Kate is the flawed and fearless heart and soul of the series, who has stark home/life decisions to make. She relies on her closest friend Anne, a no-nonsense psychiatrist and mother of two, who is facing a massive family challenge. Charming and unpredictable Frankie livens any dark moment as she struggles with her own instability and relationship malaise. And sweet, former sorority girl Jenny seeks an uncharacteristically reckless awakening. Together the friends fearlessly confront the polarizing and unexpected realities of being working moms.", "genre": "comedy", "link": "https://www.imdb.com/title/tt6143796/?ref_=adv_li_i/"}, {"name": "Friends             ", "storyline": "    Rachel Green, Ross Geller, Monica Geller, Joey Tribbiani, Chandler Bing and Phoebe Buffay are six 20 something year-olds, living off of one another in the heart of New York City. Over the course of ten years, this average group of buddies goes through massive mayhem, family trouble, past and future romances, fights, laughs, tears and surprises as they learn what it really means to be a friend.", "genre": "comedy", "link": "https://www.imdb.com/title/tt0108778/?ref_=adv_li_i/"}, {"name": "Aladdin (2019) ", "storyline": "    A live-action retelling of the 1992 Disney film of the same name.", "genre": "comedy", "link": "https://www.imdb.com/title/tt6139732/?ref_=adv_li_i/"}, {"name": "The Ballad of Buster Scruggs (2018) ", "storyline": "    Six tales of life and violence in the Old West, following a singing gunslinger, a bank robber, a traveling impresario, an elderly prospector, a wagon train, and a perverse pair of bounty hunters.", "genre": "comedy", "link": "https://www.imdb.com/title/tt6412452/?ref_=adv_li_i/"}, {"name": "This Is Us             ", "storyline": "    Rebecca Pearson once had a difficult pregnancy with triplets. The resulting births occurred on the same day as her husband Jack Pearson's thirty-sixth birthday. The lives of Rebecca, Jack and their three offspring - Kevin, Kate and Randall - are presented at different points in time. The Rebecca and Jack stories generally take place during the early stage of their marriage, surrounding the birth of the three children, or at different phases of the children's upbringing, which was not always smooth sailing for any of the five. Separate stories concerning Kevin, Kate and Randall are also presented in their adult years, each who has his or her own baggage resulting from that upbringing: Kevin who was generally the neglected one because he had no outward issues; Kate who has always had weight issues; and Randall, the gifted one, being the visible outsider and being the \"non-K\" child. These stories may demonstrate the emotional ties that exist not only because of being family, but also ...", "genre": "comedy", "link": "https://www.imdb.com/title/tt5555260/?ref_=adv_li_i/"}, {"name": "A Million Little Things             ", "storyline": "    A group of friends become motivated to living fuller lives after the unexpected death of a close friend.", "genre": "comedy", "link": "https://www.imdb.com/title/tt7608248/?ref_=adv_li_i/"}, {"name": "Crazy Rich Asians (2018) ", "storyline": "    The story follows Rachel Chu (Wu), an American-born Chinese economics professor, who travels to her boyfriend Nick's (Golding) hometown of Singapore for his best friend's wedding. Before long, his secret is out: Nick is from a family that is impossibly wealthy, he's perhaps the most eligible bachelor in Asia, and every single woman in his ultra-rarefied social class is incredibly jealous of Rachel and wants to bring her down.", "genre": "comedy", "link": "https://www.imdb.com/title/tt3104988/?ref_=adv_li_i/"}, {"name": "Second Act (2018) ", "storyline": "    A big box store worker reinvents her life and her life-story and shows Madison Avenue what street smarts can do.", "genre": "comedy", "link": "https://www.imdb.com/title/tt2126357/?ref_=adv_li_i/"}, {"name": "Modern Family             ", "storyline": "    Told from the perspective of an unseen documentary filmmaker, the series offers an honest, often-hilarious perspective of family life. Parents Phil and Claire yearn for an honest, open relationship with their three kids, but a daughter who is trying to grow up too fast, another who is too smart for her own good, and a rambunctious young son make it challenging. Claire's dad Jay and his Latina wife Gloria are raising two sons together, but people sometimes believe Jay to be Gloria's father. Jay's gay son Mitchell and his partner Cameron have adopted a little Asian girl, completing one big -- straight, gay, multicultural, traditional -- happy family.", "genre": "comedy", "link": "https://www.imdb.com/title/tt1442437/?ref_=adv_li_i/"}, {"name": "PEN15             ", "storyline": "    The comedic story of middle school seen through the eyes of two 7th grade girls dealing with the awkwardness of being a teenager.", "genre": "comedy", "link": "https://www.imdb.com/title/tt8324422/?ref_=adv_li_i/"}, {"name": "A Madea Family Funeral (2019) ", "storyline": "    A joyous reunion in small-town Georgia turns into an unexpected nightmare when Madea, Joe, Aunt Bam and other family members gather for an anniversary party that turns out to be a sham. Instead of fun and relaxation, Madea and the gang soon find themselves attending an elaborate funeral that doesn't quite go according to plan.", "genre": "comedy", "link": "https://www.imdb.com/title/tt7054636/?ref_=adv_li_i/"}, {"name": "The Hangover (2009) ", "storyline": "    Angelenos Doug Billings and Tracy Garner are about to get married. Two days before the wedding, the four men in the wedding party - Doug, Doug's two best buddies Phil Wenneck and Stu Price, and Tracy's brother Alan Garner - hop into Tracy's father's beloved Mercedes convertible for a 24-hour stag party to Las Vegas. Phil, a married high school teacher, has the same maturity level as his students when he's with his pals. Stu, a dentist, is worried about everything, especially what his controlling girlfriend Melissa thinks. Because she disapproves of traditional male bonding rituals, Stu has to lie to her about the stag, he telling her that they are going on a wine tasting tour in the Napa Valley. Regardless, he intends on eventually marrying her, against the advice and wishes of his friends. And Alan seems to be unaware of what are considered the social graces of the western world. The morning after their arrival in Las Vegas, they awaken in their hotel suite each with the worst ...", "genre": "comedy", "link": "https://www.imdb.com/title/tt1119646/?ref_=adv_li_i/"}, {"name": "How I Met Your Mother             ", "storyline": "    Ted Mosby sits down with his kids, to tell them the story of how he met their mother. The story is told through memories of his friends Marshall, Lily, Robin, and Barney Stinson. All legendary 9 seasons lead up to the moment of Ted's final encounter with \"the one.\"", "genre": "comedy", "link": "https://www.imdb.com/title/tt0460649/?ref_=adv_li_i/"}, {"name": "The Good Place             ", "storyline": "    The Good Place is a town where those who have been good throughout their lives go once they have passed away. Michael (Danson) is the architect who oversees the town--and this is the first one he has been in charge of creating. Eleanor (Bell) arrives at the Good Place and realizes they have her name right, but everything else is wrong. She isn't meant to be there at all. With the help of Chidi, her soul mate (Harper), Eleanor tries to right her wrongs, seeking to finally earn her spot in the Good Place.", "genre": "comedy", "link": "https://www.imdb.com/title/tt4955642/?ref_=adv_li_i/"}, {"name": "One Day at a Time             ", "storyline": "    Follows three generations of the same Cuban-American family living in the same house: a newly divorced former military mother, her teenage daughter and tween son, and her old-school mother.", "genre": "comedy", "link": "https://www.imdb.com/title/tt5339440/?ref_=adv_li_i/"}, {"name": "Schitt's Creek             ", "storyline": "    When filthy-rich video store magnate Johnny Rose and his family suddenly find themselves broke, they are forced to leave their pampered lives to regroup and rebuild their empire from within the rural city limits of their only remaining asset - Schitt's Creek, an armpit of a town they once bought as a joke.", "genre": "comedy", "link": "https://www.imdb.com/title/tt3526078/?ref_=adv_li_i/"}, {"name": "Parks and Recreation             ", "storyline": "    Leslie Knope, a mid-level bureaucrat in an Indiana Parks and Recreation Department, hopes to beautify her town (and boost her own career) by helping local nurse Ann Perkins turn an abandoned construction site into a community park. However, what should be a fairly simple project is stymied at every turn by oafish bureaucrats, selfish neighbors, governmental red tape, and a myriad of other challenges. Leslie's colleague Tom Haverford, who delights in exploiting his position for personal gain, is as likely to undermine her efforts as to help her, while her boss, Ron Swanson, is adamantly opposed to government in any form, even though he's a bureaucrat.", "genre": "comedy", "link": "https://www.imdb.com/title/tt1266020/?ref_=adv_li_i/"}, {"name": "Good Girls             ", "storyline": "    Three suburban mothers suddenly find themselves in desperate circumstances and decide to stop playing it safe and risk everything to take their power back.", "genre": "comedy", "link": "https://www.imdb.com/title/tt6474378/?ref_=adv_li_i/"}, {"name": "The Marvelous Mrs. Maisel             ", "storyline": "    Set in 1950s Manhattan, The Marvelous Mrs. Maisel is a 60-minute dramedy that centers on Miriam \"Midge\" Maisel, a sunny, energetic, sharp, Jewish girl who had her life mapped out: go to college, find a husband, have kids, and throw the best Yom Kippur break-fasts in town. Soon enough, she finds herself exactly where she had hoped to be, living happily with her husband and two children in the Upper West Side. A woman of her time, Midge is a cheerleader wife to a man who dreams of a stand-up comedy career, but her perfect life is upended when her husband suddenly leaves her for another woman. Utterly unprepared, Midge is left with no choice but to reevaluate her life. When she accidentally stumbles onto the stage at a nightclub, she discovers her own comedic skills and decides to use this newfound talent to help her reinvent her life. The series follows the trajectory of Midge's journey as she pursues a career in the male-dominated, stand-up comedy profession, and transforms from uptown...", "genre": "comedy", "link": "https://www.imdb.com/title/tt5788792/?ref_=adv_li_i/"}, {"name": "La La Land (2016) ", "storyline": "    Aspiring actress serves lattes to movie stars in between auditions and jazz musician Sebastian scrapes by playing cocktail-party gigs in dingy bars. But as success mounts, they are faced with decisions that fray the fragile fabric of their love affair, and the dreams they worked so hard to maintain in each other threaten to rip them apart.", "genre": "comedy", "link": "https://www.imdb.com/title/tt3783958/?ref_=adv_li_i/"}, {"name": "Orange Is the New Black             ", "storyline": "    Piper Chapman is a public relations executive with a career and a fiance when her past suddenly catches up to her. In her mid-30s she is sentenced to spend time in a minimum-security women's prison in Connecticut for her association with a drug runner 10 years earlier. This Netflix original series is based on the book of the same title. Forced to trade power suits for prison orange, Chapman makes her way through the corrections system and adjusts to life behind bars, making friends with the many eccentric, unusual and unexpected people she meets.", "genre": "comedy", "link": "https://www.imdb.com/title/tt2372162/?ref_=adv_li_i/"}, {"name": "Grace and Frankie             ", "storyline": "    Finding out that their husbands are not just work partners, but have also been romantically involved for the last twenty years, two women with an already strained relationship try to cope with the circumstances together.", "genre": "comedy", "link": "https://www.imdb.com/title/tt3609352/?ref_=adv_li_i/"}, {"name": "Big Mouth             ", "storyline": "    Teenage friends find their lives upended by the wonders and horrors of puberty.", "genre": "comedy", "link": "https://www.imdb.com/title/tt6524350/?ref_=adv_li_i/"}, {"name": "Bones             ", "storyline": "    Brilliant, but socially inept, forensic anthropologist Dr. Temperence Brennan works at the Jeffersonian Institute in Washington DC. After consulting for him on a FBI case, she is approached by cocky yet charming Former Army Ranger turned Special Agent, Seeley Booth to help the Bureau solve crimes by identifying human remains that are too far gone for standard FBI forensic investigations. Brennan's empirical, literal view of the world causes friction with Booths emotive, instinctive attitude creating a volatile relationship. However as their case load increases the symbiotic partnership produces results and with the support of Brennan's Squint Squad, murderers, past and present should be on the look out.", "genre": "comedy", "link": "https://www.imdb.com/title/tt0460627/?ref_=adv_li_i/"}, {"name": "The Goldbergs             ", "storyline": "    This ABC show takes place in Jenkintown, Pennsylvania in the 1980s and follows the lives of a family named The Goldbergs.", "genre": "comedy", "link": "https://www.imdb.com/title/tt2712740/?ref_=adv_li_i/"}, {"name": "Letterkenny             ", "storyline": "    Quick-witted, fast-paced snappy comedy about rural folk getting by in a small town.", "genre": "comedy", "link": "https://www.imdb.com/title/tt4647692/?ref_=adv_li_i/"}, {"name": "What Men Want (2019) ", "storyline": "    A woman is boxed out by the male sports agents in her profession, but gains an unexpected edge over them when she develops the ability to hear men's thoughts.", "genre": "comedy", "link": "https://www.imdb.com/title/tt7634968/?ref_=adv_li_i/"}, {"name": "Do the Right Thing (1989) ", "storyline": "    This film looks at life in the Bedford-Stuyvesant district of Brooklyn on a hot summer Sunday. As he does everyday, Sal Fragione opens the pizza parlor he's owned for 25 years. The neighborhood has changed considerably in the time he's been there and is now composed primarily of African-Americans and Hispanics. His son Pino hates it there and would like nothing better than to relocate the eatery to their own neighborhood. For Sal however, the restaurant represents something that is part of his life and sees it as a part of the community. What begins as a simple complaint by one of his customers, Buggin Out - who wonders why he has only pictures of famous Italian-Americans on the wall when most of his customers are black - eventually disintegrates into violence as frustration seemingly brings out the worst in everyone.", "genre": "comedy", "link": "https://www.imdb.com/title/tt0097216/?ref_=adv_li_i/"}, {"name": "Misfits             ", "storyline": "    Nathan, Kelly, Simon, Alisha and Curtis were expecting their community service to be boring. However after a freak thunderstorm they discover that it is anything but dull. Bestowed with strange powers, the five very different teens realize they have a lot more to worry about than just picking up litter, especially as they discover that they are not the only ones who have been given strange powers. Secrets will be revealed, feelings brought to the surface and relationships formed and broken. But hey, its only 12 weeks of community service; what's the worst that could happen?", "genre": "comedy", "link": "https://www.imdb.com/title/tt1548850/?ref_=adv_li_i/"}, {"name": "A Simple Favor (2018) ", "storyline": "    Stephanie Smothers (Anna Kendrick) is a widowed single mother who runs a blog with crafts and recipes. Emily (Blake Lively) is a busy working mother, a PR director for a fashion company, whose son Nicky attends the same elementary school as Stephanie's son, Miles. Emily and Stephanie become fast friends, arranging play dates for the boys. They trade confessions, and Stephanie admits that as a teenager, she had sex with her half-brother, Chris. Emily expresses her frustration at the lack of success of her husband, English professor Sean Townsend, and their poor financial situation. Emily has a work crisis and asks Stephanie to babysit Nicky, as Sean is in London. After two days of Emily not responding to calls, Stephanie calls Emily's employer, Dennis Nylon, and he tells her she is in Miami. Stephanie calls Sean, who calls the police. Emily had told both Stephanie and Sean that she hates having her picture taken, leading Stephanie to sneak into Emily's work and find a photo, which she ...", "genre": "comedy", "link": "https://www.imdb.com/title/tt7040874/?ref_=adv_li_i/"}, {"name": "The Upside (2017) ", "storyline": "    Philip is a disabled white billionaire, who feels that life is not worth living. To help him in his day to day routine, he hires Del, an African American parolee, trying to reconnect with his estranged wife. What begins as a professional relationship develops into a friendship as Del shows his grouchy charge that life is worth living.", "genre": "comedy", "link": "https://www.imdb.com/title/tt1987680/?ref_=adv_li_i/"}, {"name": "How to Train Your Dragon 2 (2014) ", "storyline": "    It's been five years since Hiccup and Toothless successfully united dragons and vikings on the island of Berk. While Astrid, Snotlout and the rest of the gang are challenging each other to dragon races (the island's new favorite contact sport), the now inseparable pair journey through the skies, charting unmapped territories and exploring new worlds. When one of their adventures leads to the discovery of a secret ice cave that is home to hundreds of new wild dragons and the mysterious Dragon Rider, the two friends find themselves at the center of a battle to protect the peace. Now, Hiccup and Toothless must unite to stand up for what they believe while recognizing that only together do they have the power to change the future of both men and dragons.", "genre": "comedy", "link": "https://www.imdb.com/title/tt1646971/?ref_=adv_li_i/"}, {"name": "Rick and Morty             ", "storyline": "    An animated series on adult-swim about the infinite adventures of Rick, a genius alcoholic and careless scientist, with his grandson Morty, a 14 year-old anxious boy who is not so smart. Together, they explore the infinite universes; causing mayhem and running into trouble.", "genre": "comedy", "link": "https://www.imdb.com/title/tt2861424/?ref_=adv_li_i/"}, {"name": "Slaughterhouse Rulez (2018) ", "storyline": "    An illustrious British boarding school becomes a bloody battleground when a mysterious sinkhole appears at a nearby fracking site unleashing unspeakable horror.", "genre": "comedy", "link": "https://www.imdb.com/title/tt6905696/?ref_=adv_li_i/"}, {"name": "It's Always Sunny in Philadelphia             ", "storyline": "    Five egocentric friends who run a neighborhood Irish pub in Philadelphia try to find their way through the adult world of work and relationships. Unfortunately, their warped views and precarious judgments often lead them to trouble, creating myriad uncomfortable situations that usually only get worse before they get better.", "genre": "comedy", "link": "https://www.imdb.com/title/tt0472954/?ref_=adv_li_i/"}, {"name": "Gilmore Girls             ", "storyline": "    Thirty-two year old single mom, Lorelai, lives with her teenage daughter Rory in the small town of Stars Hollow, Connecticut, with crazy neighbors and many ups and downs.", "genre": "comedy", "link": "https://www.imdb.com/title/tt0238784/?ref_=adv_li_i/"}, {"name": "New Girl             ", "storyline": "    Jess, a bubbly, off-beat teacher, who is known to burst into song, catches her boyfriend with another woman. Newly homeless, she moves into a loft with three single guys she's never met before. Nick, a jaded, law-school dropout isn't the best of company. Schmidt is a flashy, eccentric businessman who believes he is Yahweh's gift to women. Winston is a former athlete who doesn't know what to do, but really needs a win. Can this dysfunctional group handle the adorkable new girl?", "genre": "comedy", "link": "https://www.imdb.com/title/tt1826940/?ref_=adv_li_i/"}]