[{"name": "Green Book (2018) ", "storyline": "    In 1962, Tony \"Tony Lip\" Vallelonga, a tough bouncer, is looking for work when his nightclub is closed for renovations. The most promising offer turns out to be the driver for the African-American classical pianist Don Shirley for a concert tour into the Deep South states. Although hardly enthused at working for a black man, Tony accepts the job and they begin their trek armed with The Negro Motorist Green Book, a travel guide for safe travel through America's racial segregation. Together, the snobbishly erudite pianist and the crudely practical bouncer can barely get along with their clashing attitudes to life and ideals. However, as the disparate pair witness and endure America's appalling injustices on the road, they find a newfound respect for each other's talents and start to face them together. In doing so, they would nurture a friendship and understanding that would change both their lives.", "genre": "biography", "link": "https://www.imdb.com/title/tt6966692/?ref_=adv_li_i/"}, {"name": "Bohemian Rhapsody (2018) ", "storyline": "    Bohemian Rhapsody is a foot-stomping celebration of Queen, their music and their extraordinary lead singer Freddie Mercury. Freddie defied stereotypes and shattered convention to become one of the most beloved entertainers on the planet. The film traces the meteoric rise of the band through their iconic songs and revolutionary sound. They reach unparalleled success, but in an unexpected turn Freddie, surrounded by darker influences, shuns Queen in pursuit of his solo career. Having suffered greatly without the collaboration of Queen, Freddie manages to reunite with his bandmates just in time for Live Aid. While bravely facing a recent AIDS diagnosis, Freddie leads the band in one of the greatest performances in the history of rock music. Queen cements a legacy that continues to inspire outsiders, dreamers and music lovers to this day.", "genre": "biography", "link": "https://www.imdb.com/title/tt1727824/?ref_=adv_li_i/"}, {"name": "The Favourite (2018) ", "storyline": "    Early 18th century. England is at war with the French. Nevertheless, duck racing and pineapple eating are thriving. A frail Queen Anne (Olivia Colman) occupies the throne and her close friend Lady Sarah (Rachel Weisz) governs the country in her stead while tending to Anne's ill health and mercurial temper. When a new servant Abigail (Emma Stone) arrives, her charm endears her to Sarah. Sarah takes Abigail under her wing and Abigail sees a chance at a return to her aristocratic roots. As the politics of war become quite time consuming for Sarah, Abigail steps into the breach to fill in as the Queen's companion. Their burgeoning friendship gives her a chance to fulfill her ambitions and she will not let woman, man, politics or rabbit stand in her way.", "genre": "biography", "link": "https://www.imdb.com/title/tt5083738/?ref_=adv_li_i/"}, {"name": "The Irishman (2019) ", "storyline": "    A mob hitman recalls his possible involvement with the slaying of Jimmy Hoffa.", "genre": "biography", "link": "https://www.imdb.com/title/tt1302006/?ref_=adv_li_i/"}, {"name": "Rocketman (2019) ", "storyline": "    A musical fantasy about the fantastical human story of Elton John's breakthrough years.", "genre": "biography", "link": "https://www.imdb.com/title/tt2066051/?ref_=adv_li_i/"}, {"name": "BlacKkKlansman (2018) ", "storyline": "    In the early 1970s, Ron Stallworth is hired as the first black officer in the Colorado Springs, Colorado police department. Stallworth is initially assigned to work in the records room, where he faces racial slurs from his coworkers. Stallworth requests a transfer to go undercover, and is assigned to infiltrate a local rally at which national civil rights leader Kwame Ture (birth name Stokely Carmichael) is to give a speech. At the rally, Stallworth meets Patrice Dumas, the president of the black student union at Colorado College. While taking Ture to his hotel, Patrice is stopped by patrolman Andy Landers, a corrupt, racist officer in Stallworth's precinct, who threatens Ture and sexually assaults Patrice..", "genre": "biography", "link": "https://www.imdb.com/title/tt7349662/?ref_=adv_li_i/"}, {"name": "Fighting with My Family (2019) ", "storyline": "    A former wrestler and his family make a living performing at small venues around the country while his kids dream of joining World Wrestling Entertainment.", "genre": "biography", "link": "https://www.imdb.com/title/tt6513120/?ref_=adv_li_i/"}, {"name": "Vice (2018) ", "storyline": "    Governor George W. Bush of Texas picks Dick Cheney, the CEO of Halliburton Co, to be his Republican running mate in the 2000 presidential election. No stranger to politics, Cheney's impressive resume includes stints as White House chief of staff, House Minority Whip and defense secretary. When Bush wins by a narrow margin, Cheney begins to use his newfound power to help reshape the country and the world.", "genre": "biography", "link": "https://www.imdb.com/title/tt6266538/?ref_=adv_li_i/"}, {"name": "Can You Ever Forgive Me? (2018) ", "storyline": "    Lee Israel (Melissa McCarthy) made her living in the 1970's and 80's profiling the likes of Katharine Hepburn, Tallulah Bankhead, Estee Lauder and journalist Dorothy Kilgallen. When Lee is no longer able to get published because she has fallen out of step with current tastes, she turns her art form to deception, abetted by her loyal friend Jack (Richard E. Grant). An adaptation of the memoir \"Can You Ever Forgive Me?\" relays the true story of the best-selling celebrity biographer (and friend to cats).", "genre": "biography", "link": "https://www.imdb.com/title/tt4595882/?ref_=adv_li_i/"}, {"name": "Mary Queen of Scots (2018) ", "storyline": "    Mary Queen of Scots explores the turbulent life of the charismatic Mary Stuart. Queen of France at 16 and widowed at 18, Mary defies pressure to remarry. Instead, she returns to her native Scotland to reclaim her rightful throne. But Scotland and England fall under the rule of the compelling Elizabeth I. Each young Queen beholds her \"sister\" in fear and fascination. Rivals in power and in love, and female regents in a masculine world, the two must decide how to play the game of marriage versus independence. Determined to rule as much more than a figurehead, Mary asserts her claim to the English throne, threatening Elizabeth's sovereignty. Betrayal, rebellion, and conspiracies within each court imperil both thrones - and change the course of history.", "genre": "biography", "link": "https://www.imdb.com/title/tt2328900/?ref_=adv_li_i/"}, {"name": "First Man (2018) ", "storyline": "    A Biopic on the life of the legendary American Astronaut Neil Armstrong from 1961-1969, on his journey to becoming the first human to walk the moon. Exploring the sacrifices and costs on the Nation and Neil himself, during one of the most dangerous missions in the history of space travel.", "genre": "biography", "link": "https://www.imdb.com/title/tt1213641/?ref_=adv_li_i/"}, {"name": "The Dirt (2019) ", "storyline": "    The story of how Mötley Crüe came to be one of the most notorious rock 'n roll groups in history.", "genre": "biography", "link": "https://www.imdb.com/title/tt0800325/?ref_=adv_li_i/"}, {"name": "Skin (2018) ", "storyline": "    Based on the 2012 MSNBC documentary, Bryon Widner was one of the FBI's most sought after white supremacists. Covered in racist tattoos from head to toe that he earned performing hate crimes, he conducts a destructive life and is headed down the path of no return. When he meets Julie and her three young daughters from previous relationships, the responsibilities of fatherhood give him the desire to leave the movement behind. He endures death threats and harassment from his old gang while attempting to turn his life around. With the help of the FBI and SPLC, he undergoes 25 brutal tattoo removal surgeries in exchange for decoding the tattoos covering his body, which culminates in the arrest and conviction of his former gang.", "genre": "biography", "link": "https://www.imdb.com/title/tt6043142/?ref_=adv_li_i/"}, {"name": "Lords of Chaos (2018) ", "storyline": "    Oslo, 1987. 17-year-old Euronymous is determined to escape his traditional upbringing and becomes fixated on creating 'true Norwegian black metal' with his band Mayhem. He mounts shocking publicity stunts to put the band's name on the map, but the lines between show and reality start to blur. Arson, violence and a vicious murder shock the nation that is under siege by these Lords of Chaos.", "genre": "biography", "link": "https://www.imdb.com/title/tt4669296/?ref_=adv_li_i/"}, {"name": "The Greatest Showman (2017) ", "storyline": "    Orphaned, penniless but ambitious and with a mind crammed with imagination and fresh ideas, the American Phineas Taylor Barnum will always be remembered as the man with the gift to effortlessly blur the line between reality and fiction. Thirsty for innovation and hungry for success, the son of a tailor will manage to open a wax museum but will soon shift focus to the unique and peculiar, introducing extraordinary, never-seen-before live acts on the circus stage. Some will call Barnum's wide collection of oddities, a freak show; however, when the obsessed showman gambles everything on the opera singer Jenny Lind to appeal to a high-brow audience, he will somehow lose sight of the most important aspect of his life: his family. Will Barnum risk it all to be accepted?", "genre": "biography", "link": "https://www.imdb.com/title/tt1485796/?ref_=adv_li_i/"}, {"name": "The Kid (2019) ", "storyline": "    The story of a young boy who witnesses Billy the Kid's encounter with Sheriff Pat Garrett.", "genre": "biography", "link": "https://www.imdb.com/title/tt4975920/?ref_=adv_li_i/"}, {"name": "At Eternity's Gate (2018) ", "storyline": "    During a self-imposed exile in Arles and Auvers-Sur-Oise, France, Dutch painter Vincent van Gogh develops his unique, colorful style of painting. While grappling with religion, mental illness and a tumultuous friendship with French artist Paul Gauguin, van Gogh begins to focus on his relationship with eternity rather than the pain his art causes him in the present.", "genre": "biography", "link": "https://www.imdb.com/title/tt6938828/?ref_=adv_li_i/"}, {"name": "American Crime Story             ", "storyline": "    The People v. O.J. Simpson: American Crime Story is a limited series that takes you inside the O.J. Simpson trial with a riveting look at the legal teams battling to convict or acquit the football legend of double homicide. Based on the book The Run of His Life: The People v. O.J. Simpson by Jeffrey Toobin, it explores the chaotic behind-the-scenes dealings and maneuvering on both sides of the court, and how a combination of prosecution overconfidence, defense shrewdness, and the LAPD's history with the city's African-American community gave a jury what it needed: reasonable doubt.", "genre": "biography", "link": "https://www.imdb.com/title/tt2788432/?ref_=adv_li_i/"}, {"name": "Victoria             ", "storyline": "    The early life of Queen Victoria, from her ascension to the throne at the tender age of 18 to her courtship and marriage to Prince Albert.", "genre": "biography", "link": "https://www.imdb.com/title/tt5137338/?ref_=adv_li_i/"}, {"name": "El fotógrafo de Mauthausen (2018) ", "storyline": "    1943. With the World War II in the maximum exchange of hostilities, life is too merciless and cruel for the inmates who live in the camp of Mauthausen, where between others they are the soldiers who fought and lost in the Spanish Civil War, exiled from Spain by General Franco after to won the war, considering them as no men's land and gifted to Third Reich as free workforce. In this scenery of eternal horror and brutality caused by the Nazis and the Kapos (violent inmates who work as guards to keep the order), young Francesc Boix tries to survive in the camp working as photographer being Paul Ricken's right-hand, Mauthausen's warden. Boix's daily life taking photos, talking with another inmates as Balbuena and Fonseca and making files of the dead inmates who died in failed escapes changes after to realize in an amateur radio created by them that the Third Reich have loss against Soviet Army in the Battle of Stalingrad. Fearing that Ricken and the rest of the Nazis make disappear all ...", "genre": "biography", "link": "https://www.imdb.com/title/tt6704776/?ref_=adv_li_i/"}, {"name": "Medici             ", "storyline": "    A political, family drama set in Florence in the early 15th century. Cosimo de' Medici finds himself at the helm of his supremely wealthy, banking dynasty family, when his father, Giovanni dies suddenly. However Cosimo is concealing a dangerous secret - Giovanni was murdered. Now Cosimo and his brother must unearth his killer in order to protect the wealth and power of the family.", "genre": "biography", "link": "https://www.imdb.com/title/tt5057130/?ref_=adv_li_i/"}, {"name": "Narcos             ", "storyline": "    Narcos tells the true-life story of the growth and spread of cocaine drug cartels across the globe and attendant efforts of law enforcement to meet them head on in brutal, bloody conflict. It centers around the notorious Colombian cocaine kingpin Pablo Escobar (Wagner Moura) and Steve Murphy (Holbrook), a DEA agent sent to Colombia on a U.S. mission to capture him and ultimately kill him.", "genre": "biography", "link": "https://www.imdb.com/title/tt2707408/?ref_=adv_li_i/"}, {"name": "The Revenant (2015) ", "storyline": "    While exploring uncharted wilderness in 1823, legendary frontiersman Hugh Glass sustains injuries from a brutal bear attack. When his hunting team leaves him for dead, Glass must utilize his survival skills to find a way back home while avoiding natives on their own hunt. Grief-stricken and fueled by vengeance, Glass treks through the wintry terrain to track down John Fitzgerald, the former confidant who betrayed and abandoned him.", "genre": "biography", "link": "https://www.imdb.com/title/tt1663202/?ref_=adv_li_i/"}, {"name": "On the Basis of Sex (2018) ", "storyline": "    The true story of Ruth Bader Ginsburg, her struggles for equal rights, and the early cases of a historic career that lead to her nomination and confirmation as U.S. Supreme Court Associate Justice.", "genre": "biography", "link": "https://www.imdb.com/title/tt4669788/?ref_=adv_li_i/"}, {"name": "Extremely Wicked, Shockingly Evil, and Vile (2019) ", "storyline": "    A chronicle of the crimes of Ted Bundy, from the perspective of his longtime girlfriend, Elizabeth Kloepfer, who refused to believe the truth about him for years.", "genre": "biography", "link": "https://www.imdb.com/title/tt2481498/?ref_=adv_li_i/"}, {"name": "Fosse/Verdon             ", "storyline": "    An inside look at the romantic and creative partnership between influential choreographer/director, Bob Fosse, and Gwen Verdon, one of the greatest Broadway dancers of all time.", "genre": "biography", "link": "https://www.imdb.com/title/tt8746478/?ref_=adv_li_i/"}, {"name": "Spartacus: Blood and Sand             ", "storyline": "    The inspiration behind this series is the Thracian Gladiator Spartacus, who led a slave uprising against the Roman Republic. The Thracians had been persuaded by Claudius Glaber to serve as auxiliaries in the Roman legions in a campaign against the Getae, who had often plundered Thracian lands. However after Glaber reneges on the deal and switches his attentions from the Getae to attack Mithridates in Asia Minor, the Thracians feel betrayed and mutiny. Captured by Glaber, Spartacus is condemned to death as a Gladiator, whilst his wife Sura is condemned to slavery. Spartacus, however, proves to be a formidable gladiator, and defeats the four gladiators tasked with executing him. He becomes a favorite of the crowd, leading Senator Albinius to commute his death sentence to a life of slavery. Spartacus is purchased by Batiatus for gladiator training, who promises to help him find Sura if he proves himself in training. As the series develops, the story follows the betrayals and machinations...", "genre": "biography", "link": "https://www.imdb.com/title/tt1442449/?ref_=adv_li_i/"}, {"name": "Schindler's List (1993) ", "storyline": "    Oskar Schindler is a vainglorious and greedy German businessman who becomes an unlikely humanitarian amid the barbaric German Nazi reign when he feels compelled to turn his factory into a refuge for Jews. Based on the true story of Oskar Schindler who managed to save about 1100 Jews from being gassed at the Auschwitz concentration camp, it is a testament to the good in all of us.", "genre": "biography", "link": "https://www.imdb.com/title/tt0108052/?ref_=adv_li_i/"}, {"name": "Beautiful Boy (2018) ", "storyline": "    Based on the best-selling pair of memoirs from father and son David and Nic Sheff, Beautiful Boy chronicles the heartbreaking and inspiring experience of survival, relapse, and recovery in a family coping with addiction over many years.", "genre": "biography", "link": "https://www.imdb.com/title/tt1226837/?ref_=adv_li_i/"}, {"name": "The Wolf of Wall Street (2013) ", "storyline": "    Jordan Belfort is a Long Island penny stockbroker who served 22 months in prison for defrauding investors in a massive 1990s securities scam that involved widespread corruption on Wall Street and in the corporate banking world, including shoe designer Steve Madden.", "genre": "biography", "link": "https://www.imdb.com/title/tt0993846/?ref_=adv_li_i/"}, {"name": "American Sniper (2014) ", "storyline": "    Chris Kyle was nothing more than a Texan man who dreamed of becoming a cowboy, but in his thirties he found out that maybe his life needed something different, something where he could express his real talent, something that could help America in its fight against terrorism. So he joined the SEALs in order to become a sniper. After marrying, Kyle and the other members of the team are called for their first tour of Iraq. Kyle's struggle isn't with his missions, but about his relationship with the reality of the war and, once returned at home, how he manages to handle it with his urban life, his wife and kids.", "genre": "biography", "link": "https://www.imdb.com/title/tt2179136/?ref_=adv_li_i/"}, {"name": "Boy Erased (2018) ", "storyline": "    The son of a Baptist preacher is forced to participate in a church-supported gay conversion program after being forcibly outed to his parents.", "genre": "biography", "link": "https://www.imdb.com/title/tt7008872/?ref_=adv_li_i/"}, {"name": "Lion (2016) ", "storyline": "    In 1986, Saroo was a five-year-old child in India of a poor but happy rural family. On a trip with his brother, Saroo soon finds himself alone and trapped in a moving decommissioned passenger train that takes him to Calcutta, 1000 miles away from home. Now totally lost in an alien urban environment and too young to identify either himself or his home to the authorities, Saroo struggles to survive as a street child until he is sent to an orphanage. Soon, Saroo is selected to be adopted by the Brierley family in Tasmania, where he grows up in a loving, prosperous home. However, for all his material good fortune, Saroo finds himself plagued by his memories of his lost family in his adulthood and tries to search for them even as his guilt drives him to hide this quest from his adoptive parents and his girlfriend. Only when he has an epiphany does he realize not only the answers he needs, but also the steadfast love that he has always had with all his loved ones in both worlds.", "genre": "biography", "link": "https://www.imdb.com/title/tt3741834/?ref_=adv_li_i/"}, {"name": "Tolkien (2019) ", "storyline": "    Tolkien explores the formative years of the orphaned author as he finds friendship, love and artistic inspiration among a group of fellow outcasts at school. This takes him into the outbreak of World War I, which threatens to tear the \"fellowship\" apart. All of these experiences would inspire Tolkien to write his famous Middle-Earth novels.", "genre": "biography", "link": "https://www.imdb.com/title/tt3361792/?ref_=adv_li_i/"}, {"name": "The Big Short (2015) ", "storyline": "    Three separate but parallel stories of the U.S mortgage housing crisis of 2005 are told. Michael Burry, an eccentric ex-physician turned one-eyed Scion Capital hedge fund manager, has traded traditional office attire for shorts, bare feet and a Supercuts haircut. He believes that the US housing market is built on a bubble that will burst within the next few years. Autonomy within the company allows Burry to do largely as he pleases, so Burry proceeds to bet against the housing market with the banks, who are more than happy to accept his proposal for something that has never happened in American history. The banks believe that Burry is a crackpot and therefore are confident in that they will win the deal. Jared Vennett with Deutschebank gets wind of what Burry is doing and, as an investor believes he too can cash in on Burry's beliefs. An errant telephone call to FrontPoint Partners gets this information into the hands of Mark Baum, an idealist who is fed up with the corruption in the ...", "genre": "biography", "link": "https://www.imdb.com/title/tt1596363/?ref_=adv_li_i/"}, {"name": "I, Tonya (2017) ", "storyline": "    From the proverbial wrong side of the tracks in Portland, Oregon, former competitive figure skater Tonya Harding was never fully accepted in the figure skating community for not inherently being the image of grace, breeding and privilege that the community wanted to portray, despite she being naturally gifted in the sport athletically. Despite ultimately garnering some success in figure skating being national champion, a world championship medalist, an Olympian, and being the first American woman to complete a Triple Axel in competition, she is arguably best known for her association to \"the incident\": the leg bashing on January 6, 1994 of her competitor, Nancy Kerrigan, who, unlike Tonya, was everything that the figure skating community wanted in their representatives. Her association to that incident led to Tonya being banned from competitive figure skating for life. Tonya's story from the beginning of her figure skating life at age four to the aftermath of the incident is presented...", "genre": "biography", "link": "https://www.imdb.com/title/tt5580036/?ref_=adv_li_i/"}, {"name": "12 Years a Slave (2013) ", "storyline": "    Based on an incredible true story of one man's fight for survival and freedom. In the pre-Civil War United States, Solomon Northup, a free black man from upstate New York, is abducted and sold into slavery. Facing cruelty personified by a malevolent slave owner, as well as unexpected kindnesses, Solomon struggles not only to stay alive, but to retain his dignity. In the twelfth year of his unforgettable odyssey, Solomon's chance meeting with a Canadian abolitionist will forever alter his life.", "genre": "biography", "link": "https://www.imdb.com/title/tt2024544/?ref_=adv_li_i/"}, {"name": "The Old Man & the Gun (2018) ", "storyline": "    Based on the true story of Forrest Tucker (Robert Redford), from his audacious escape from San Quentin at the age of 70 to an unprecedented string of heists that confounded authorities and enchanted the public. Wrapped up in the pursuit are detective John Hunt (Casey Affleck), who becomes captivated with Forrest's commitment to his craft, and a woman (Sissy Spacek), who loves him in spite of his chosen profession.", "genre": "biography", "link": "https://www.imdb.com/title/tt2837574/?ref_=adv_li_i/"}, {"name": "Outlaw King (2018) ", "storyline": "    After being declared \"Outlaw\" by the occupying English Empire, Robert the Bruce (Chris Pine) raises an army of Scottish fighters in rebellion. Twists and turns all across the Scottish countryside lead this film on an epic, \"true to historical events\", journey that captures heroism at its core!", "genre": "biography", "link": "https://www.imdb.com/title/tt6679794/?ref_=adv_li_i/"}, {"name": "The Front Runner (2018) ", "storyline": "    Gary Hart, a U.S. senator from Colorado, is the widely accepted front-runner in the race for the Democratic presidential nomination. After losing the 1984 nomination to vice-president Walter Mondale, Hart decides to run for President of the United States. At one point during his campaign, against the will of his manager Bill Dixon, Hart challenges the press and public to \"follow him around\" while he's not campaigning on weekends. This proves to be a mistake when in 1987, photos of him and journalist Donna Rice are published by Miami Herald Reporters. In a desperate attempt to clear his name, Hart tries to fix his reputation at a news event concerning the affair but to no avail. Because of the consequences of his actions, Hart is disgraced, berated by Dixon, and forced to drop out of the campaign while his wife Oletha remains to be close with him. Donna also announces that she has personally denied sleeping with the now former senator..", "genre": "biography", "link": "https://www.imdb.com/title/tt7074886/?ref_=adv_li_i/"}, {"name": "Stan & Ollie (2018) ", "storyline": "    The true story of Hollywood's greatest comedy double act, Laurel and Hardy, is brought to the big screen for the first time. Starring Steve Coogan and John C. Reilly as the inimitable movie icons, Stan and Ollie is the heart-warming story of what would become the pair's triumphant farewell tour. With their golden era long behind them, the pair embark on a variety hall tour of Britain and Ireland. Despite the pressures of a hectic schedule, and with the support of their wives Lucille (Shirley Henderson) and Ida (Nina Arianda) - a formidable double act in their own right - the pair's love of performing, as well as for each other, endures as they secure their place in the hearts of their adoring public.", "genre": "biography", "link": "https://www.imdb.com/title/tt3385524/?ref_=adv_li_i/"}, {"name": "Hacksaw Ridge (2016) ", "storyline": "    The true story of Desmond T. Doss, the conscientious objector who, at the Battle of Okinawa, was awarded the Medal of Honor for his incredible bravery and regard for his fellow soldiers. We see his upbringing and how this shaped his views, especially his religious view and anti-killing stance. We see Doss's trials and tribulations after enlisting in the US Army and trying to become a medic. Finally, we see the hell on Earth that was Hacksaw Ridge.", "genre": "biography", "link": "https://www.imdb.com/title/tt2119532/?ref_=adv_li_i/"}, {"name": "A Private War (2018) ", "storyline": "    In a world where journalism is under attack, Marie Colvin (Rosamund Pike) is one of the most celebrated war correspondents of our time. Colvin is an utterly fearless and rebellious spirit, driven to the frontlines of conflicts across the globe to give voice to the voiceless, while constantly testing the limits between bravery and bravado. After being hit by a grenade in Sri Lanka, she wears a distinctive eye patch and is still as comfortable sipping martinis with London's elite as she is confronting dictators. Colvin sacrifices loving relationships, and over time, her personal life starts to unravel as the trauma she's witnessed takes its toll. Yet, her mission to show the true cost of war leads her -- along with renowned war photographer Paul Conroy (Jamie Dornan) -- to embark on the most dangerous assignment of their lives in the besieged Syrian city of Homs.", "genre": "biography", "link": "https://www.imdb.com/title/tt2368254/?ref_=adv_li_i/"}, {"name": "Tombstone (1993) ", "storyline": "    After success cleaning up Dodge City, Wyatt Earp moves to Tombstone, Arizona, and wishes to get rich in obscurity. He meets his brothers there, as well as his old friend Doc Holliday. A band of outlaws that call themselves The Cowboys are causing problems in the region with various acts of random violence, and inevitably come into confrontation with Holliday and the Earps, which leads to a shoot-out at the O.K. Corral.", "genre": "biography", "link": "https://www.imdb.com/title/tt0108358/?ref_=adv_li_i/"}, {"name": "Hidden Figures (2016) ", "storyline": "    As the United States raced against Russia to put a man in space, NASA found untapped talent in a group of African-American female mathematicians that served as the brains behind one of the greatest operations in U.S. history. Based on the unbelievably true life stories of three of these women, known as \"human computers\", we follow these women as they quickly rose the ranks of NASA alongside many of history's greatest minds specifically tasked with calculating the momentous launch of astronaut John Glenn into orbit, and guaranteeing his safe return. Dorothy Vaughan, Mary Jackson, and Katherine Gobels Johnson crossed all gender, race, and professional lines while their brilliance and desire to dream big, beyond anything ever accomplished before by the human race, firmly cemented them in U.S. history as true American heroes.", "genre": "biography", "link": "https://www.imdb.com/title/tt4846340/?ref_=adv_li_i/"}, {"name": "Three Identical Strangers (2018) ", "storyline": "    New York, 1980: three complete strangers accidentally discover that they are identical triplets, separated at birth. The 19-year-olds' joyous reunion catapults them to international fame, but it also unlocks an extraordinary and disturbing secret that goes beyond their own lives - and could transform our understanding of human nature forever.", "genre": "biography", "link": "https://www.imdb.com/title/tt7664504/?ref_=adv_li_i/"}, {"name": "Molly's Game (2017) ", "storyline": "    Molly Bloom, a beautiful young Olympic-class skier, ran the world's most exclusive high-stakes poker game for a decade before being arrested in the middle of the night by 17 FBI agents wielding automatic weapons. Her players included Hollywood royalty, sports stars, business titans, and finally, unbeknownst to her, the Russian mob. Her only ally was her criminal defense lawyer Charlie Jaffey, who learned that there was much more to Molly than the tabloids led us to believe.", "genre": "biography", "link": "https://www.imdb.com/title/tt4209788/?ref_=adv_li_i/"}, {"name": "Darkest Hour (2017) ", "storyline": "    During World War II, as Adolf Hitler's awesomely powerful Wehrmacht rampages across Europe, the Prime Minister of the United Kingdom, Neville Chamberlain, is forced to resign, recommending Winston Churchill as his replacement. But even in his early days as the country's leader, Churchill is under pressure to commence peace negotiations with the German dictator or to fight head-on the seemingly invincible Nazi regime, whatever the cost. However difficult and dangerous his decision may be, Churchill has no choice but to shine in the country's darkest hour.", "genre": "biography", "link": "https://www.imdb.com/title/tt4555426/?ref_=adv_li_i/"}, {"name": "Leaving Neverland (2019) ", "storyline": "    At the height of his stardom, the world's biggest pop star, Michael Jackson, began long-running relationships with two boys, aged seven and ten, and their families. They now allege that he sexually abused them.", "genre": "biography", "link": "https://www.imdb.com/title/tt9573980/?ref_=adv_li_i/"}, {"name": "Breakthrough (2019) ", "storyline": "    When he was 14, Smith drowned in Lake Sainte Louis and was dead for nearly an hour. According to reports at the time, CPR was performed 27 minutes to no avail. Then the youth's mother, Joyce Smith, entered the room, praying loudly. Suddenly, there was a pulse, and Smith came around.", "genre": "biography", "link": "https://www.imdb.com/title/tt7083526/?ref_=adv_li_i/"}]